app/views/posts/reporte.html.erb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."post_id" = ?  [["post_id", 2]]
---
	        <td><%= post.updated_at %></td>
	        <td><%= post.reviews.length%></td>