app/controllers/reviews_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "reviews" ("created_at", "descrition", "like", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-04-08 15:12:40.031531"], ["descrition", "primer review"], ["like", 0], ["post_id", 7], ["updated_at", "2015-04-08 15:12:40.031531"]]
---
def create
	#@review = Review.new(review_params)
	#if @review.save
	#	redirect_to "/posts/"+@review.post_id.to_s, notice: "review created xD"
	#else
	#	render "show"
	#end
	@clave_post = params[:post_id]
		@descripcion_review = params[:descripcion]
		@nuevo = Post.find(@clave_post)
		if @nuevo.reviews.build(descrition: @descripcion_review).save

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "reviews" SET "like" = ?, "updated_at" = ? WHERE "reviews"."id" = 7  [["like", 1], ["updated_at", "2015-04-08 15:12:55.771957"]]
---
def like_review
	@post = Review.find(params[:id])
    @post.like = @post.like + 1
    if @post.save

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "reviews" SET "like" = ?, "updated_at" = ? WHERE "reviews"."id" = 7  [["like", 3], ["updated_at", "2015-04-08 15:17:32.941552"]]
---
def dislike_review
	@post = Review.find(params[:id])
    @post.like = @post.like - 1
    if @post.save